Repository: JianLaiTL/JianLai
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 刀出鞘了，剑也出鞘了，但是她竟然沦落到被人空手夺白刃的地步。
en_us: Both her blades had been drawn, yet she had been disarmed in an instant.

source: 刘家那块传承千年的家族堂匾额，砰然碎裂，出现条条触目惊心的裂缝。
en_us: Right at this moment, a series of cracks abruptly appeared without any warning on the family plaque that had been passed for over 1,000 years in the Liu Clan.

source: 刘志茂如释重负，这次总算没有那般谄媚，故意行儒生揖礼，而只是打了个庄重的道家稽首，“长者赐不敢辞，齐先生的大恩大德，晚辈铭感五内，没齿难忘！”
en_us: Liu Zhimao felt as if a huge weight had been taken off his shoulder. Thus, he didn't try to act obsequiously and perform a confucian bow this time, instead performing a dignified Daoist bow. "I wouldn't dare to refuse senior's bestowal. This junior will definitely remember Mr. Qi's benevolence for as long as I live!"

source: 刘志茂毫无征兆地吐出一口鲜血，手心也鲜血溅射，像是被人用利器使劲割出一条血槽。
en_us: Without any warning at all, Liu Zhimao suddenly spat a mouthful of blood. At the same time, blood also shot from his hand. It was as if someone had slashed his hand with a sharp blade.

source: 刘志茂狂喜道：“先生放心，晚辈这就携带顾氏母子离开小镇。”
en_us: Liu Zhimao was overjoyed as he said, "Rest assured, Mr. Qi, I'll immediately leave this town with Gu Can and his mother."

source: 刘志茂眼前一亮，二话不说就让妇人带路，去一探究竟。
en_us: Liu Zhimao's eyes lit up, and he immediately ordered the woman to lead him over to investigate.

source: 刘志茂突然咦了一声，惊讶出声，睁眼低头观看掌心纹路，好似岔开出来一条新路，自言自语道：“这是为何？不应该啊。少年没死，反倒是那仙家子弟，莫名其妙死了？”
en_us: "Hmm?" A surprised expression suddenly appeared on Liu Zhimao's face, and he opened his eyes to look down at the patterns on his palm. It was as if a new "road" had appeared, and he said to himself, "Why is this? It shouldn't be! The young boy didn't die, and it was instead that immortal disciple that mysteriously died?"

source: 刘灞桥一脸匪夷所思，“那么大一个家族，就让一个年纪轻轻的女子来祭祖？然后搞得差点被那位大骊藩王一拳打死？陈松风，我读书不少的，虽然多是一些床上神仙打架的脂粉书，可确实由此领悟到了好多人情世故，所以我觉得那娘们肯定是个假冒货！”
en_us: Liu Baqiao was utterly perplexed. "They're such a large and powerful clan, yet they only sent a single young girl over to pay respects to their ancestors? And she was almost punched to death by Song Changjing as well! Chen Songfeng, I've read quite a few books — even though some of them are about things that happen under blankets — so I do indeed have some understanding of people and events. With what I know, I feel like she's definitely an imposter!"

source: 刘灞桥之前在督造官衙署陪着崔先生闲聊，听说李家大宅的动静后，就闻着了腥味，不过这位风雷园的俊彦翘楚，再自负也没敢登门挑衅一头搬山猿，就是寻思着能不能隔岸观火，如果有机会阴一把老猿，更是大快人心。所以刘灞桥摸到了一处大宅翘檐上，俯瞰小镇，寻找老猿的动向，结果很快就发现城西泥瓶巷那边的异样动静，于是生性胆大的刘灞桥就悄然盯梢。
en_us: Earlier, Liu Baqiao had been chatting with Cui Minghuang at the office of the kiln supervision official, and after hearing about the commotion at the Li Clan's manor, it didn't take long before he smelled the scent of blood in the air. However, despite his bold and brash personality, even he knew better than to directly challenge a Mountain-moving Ape on his own. However, he was keen observing from the sidelines, trying to see if an opportunity would arise that would allow him to strike the old ape with a sneak attack. With that in mind, Liu Baqiao had gotten onto the rooftop of a tall building, and from that vantage point, he scoured the town with his gaze, searching for the old ape. It didn't take long for him to discover the commotion ringing out in Clay Vase Alley, and thus, he directed his attention to the unfolding chaos.

source: 刘灞桥也不管陈平安烦不烦，自顾自说起了小镇那边的趣闻趣事，说那谁谁谁得了一份让人眼的红机缘，竟然把锁龙井的整条铁链子拽出了深井；还有某某逛了几天也没找着机缘，
en_us: Not caring about whether Chen Ping'an found him annoying or not, Liu Baqiao continued to rattle on about all the interesting things that he had seen and heard in the small town. For example, he mentioned a person who had obtained an enviable fated opportunity, and they had actually been able to drag the entire iron chain out of the Dragon Locking Well. However, there was also some person who had failed to obtain any fated opportunity even after walking around for several days.

source: 刘灞桥伸出一只手掌，“打住！”
en_us: "I'm gonna get you to stop right there!" Liu Baqiao hurriedly interrupted as he raised a hand.

source: 刘灞桥佯装要起身，双手撑在椅子把手上，故作惊慌道：“我赶紧给那位姑奶奶道歉去，我了个乖乖，就这种蛮横不讲理的身世，别说让你陈松风翻几本书，就是让你做牛做马也没半点问题嘛。”
en_us: Liu Baqiao pretended that he was about to stand up, with his hands pushing down on the arms of his chair. There was mock fear on his face, and he exclaimed, "Oh, then I should hurry up and apologize to that esteemed lady! My heavens! With such a profound and powerful background, she even has the right to treat you as a slave, to say nothing of asking you to flip through a few records."

source: 刘灞桥做了一个往地上随手丢掷物品的手势。
en_us: Liu Baqiao casually made a throwing gesture.

source: 刘灞桥冷笑道：“坚决不去，去蚂蚁堆里作威作福，老子臊得慌。”
en_us: A cold smile appeared on Liu Baqiao's face as he replied, "Absolutely not! It would be far too shameful for me to stoop down to such a lowly place."

source: 刘灞桥刚从椅子上抬起屁股，闻言后一屁股坐回去，气笑道：“呦呵，还有心情调侃我，你小子胸襟气度可以啊。”
en_us: Liu Baqiao had just started to stand up, yet he immediately sat back down after hearing this. "Hah, you're still in the mood to tease me? Seems like you're quite a tolerant person!" he chuckled in frustration.

source: 刘灞桥刚想问干啥，蓦然闭上嘴巴。
en_us: Liu Baqiao was just about to ask a question, but he immediately shut his mouth.

source: 刘灞桥双手抱住后脑勺，满脸不屑道：“说句难听的话，如今咱们东宝瓶洲那三块福地，谁不心知肚明，早就变味了，已经成为那些个世俗王朝的豪阀子弟，花钱下去找乐子的地儿，难怪被说成是仙家治下的青楼勾栏之地，乌烟瘴气。”
en_us: Liu Baqiao clasped his hands together behind the back of his head, and a disdainful look appeared on his face as he continued, "Let's not mince our words here. Everyone knows that the three blessed lands of the Eastern Treasured Vial Continent are no longer what they once were. They've already become places where the nobility of the empires go to spend money for entertainment. No wonder they're referred to as brothels under the rule of the immortal clans."

source: 刘灞桥叹了口气，抬手狠狠揉了揉脸颊。
en_us: Liu Baqiao sighed upon hearing this. He raised his hands and roughly massaged his cheeks.

source: 刘灞桥叹了口气，松开一只手，拍了拍自己的肚子，自嘲道：“我呢，就是口拙嘴笨，拳头也不够硬，剑还不够快，要不然我这肚子里，真是积攒了一大堆道理，想要跟这个世道，好好说上一说。”
en_us: Liu Baqiao sighed as he removed a hand from the back of his head, then patted his own belly as he mused in a self-deprecating voice, "I'm not good with words, my fists aren't hard enough, and my swords isn't sharp enough. Otherwise, there are many people in this world that I'd like to talk some sense into."

source: 刘灞桥听得叹为观止，难怪大骊王朝在短短两三百年间，崛起迅猛，已经形成了吞并一洲北部疆土的恢弘气势，刘松锋听得入神，干脆就盘腿坐在椅子上，用手心摩擦着下巴，问道：
en_us: Liu Baqiao was astonished and amazed as he listened to this. It was no wonder the Great Li Empire had ferociously soared to such lofty heights in just a mere 200 to 300 years, becoming a powerful empire that controlled the entire northern stretches of the continent.

source: 刘灞桥和陈松风沿着原路返回，在两人能够看到廊桥轮廓的时候，已是黄昏时分，刘灞桥沿着一条小径走到溪畔，蹲下身掬了一捧水洗脸，约莫是嫌弃不够酣畅淋漓，干脆撅起屁股趴在地上，将整个脑袋沉入溪水当中，最后猛然抬头，大呼痛快，转头看着大汗淋漓的陈松风，刘灞桥打趣道：“一介文弱书生，手无缚鸡之力啊。”
en_us: Liu Baqiao and Chen Songfeng were returning the same way they had come, and by the time they spotted the outlines of the covered bridge in the distance, it was already dusk. Liu Baqiao followed a small path to the bank of the creek, where he crouched down and scooped up some water with his hands before splashing it onto his own face. That didn't seem to have been sufficiently reinvogorating for him, so he knelt down onto the ground with his rear end pointed up at the heavens and plunged his entire head into the creek, then abruptly threw his head back in exhiliration. He turned to Chen Songfeng, who was sweating profusely, and jibed, "Are all scholars as weak and frail as you?"

source: 刘灞桥咦了一声，“不对啊，刘姓少年家祖传的剑经，不是出自于正阳山那位叛徒吗？当然了，也算是我们风雷园的祖师之一，不管如何，时间对不上，怎么能够成为陈对家族的守墓人？”
en_us: Liu Baqiao frowned slightly and muttered, "Hmm? But how can this be? Didn't the traitor from Sun Scorch Mountain create that sword scripture? Of course, he can also be regarded as one of the ancestors of Wind Lightning Field. Regardless, these timelines don't match, so how can the Liu Clan have become the Chen Clan's graveyard attendent?"

source: 刘灞桥哈哈笑道：“不是。不过比金子值钱多了”
en_us: "No, but it's way more valuable than gold," Liu Baqiao chuckled.

source: 刘灞桥哪里见过这样的乡土气，不但不觉得鄙陋，反而觉得颇为有趣，这份热闹看得津津有味，哪怕被妇人骂得挺惨，却不怒反笑，自己在师门风雷园每次吵架后，都会有一种寂寞，觉得空有一身好武艺，却没有旗鼓相当的对手，不曾想今天终于有了用武之地，便来劲了，嬉皮笑脸道：“没断奶咋的，大姐你能帮忙啊？”
en_us: Liu Baqiao had never seen an unrefined villager like this before, but not only was he not filled with disgust and disdain, he was very much amused. He had been treated to a good show, and instead of being enraged by the woman's scathing insults, he only became more amused. Whenever he had a war of words with anyone back at the Wind Lightning Field, he would always be struck by a sense of loneliness as he could never find a fitting opponent. Never did he think that he would encounter a worthy opponent in this place! With that in mind, he rose to the challenge, putting on a cheeky grin as he asked, "Can you help me with being breastfed?"

source: 刘灞桥啧啧称奇。
en_us: Liu Baqiao clicked his tongue in wonder.

source: 刘灞桥啧啧道：“一弹指，就能够将我飞剑弹回窍穴，还能不伤我半点神魂，实在是匪夷所思。”
en_us: Meanwhile, Liu Baqiao mused, "With just a flick of his finger, he was able to force my flying sword back into my acupoint without harming my soul at all. What a master display of power and control."

source: 刘灞桥啧啧道：“宁姑娘你这性子，就不如我家苏仙子了。”
en_us: Liu Baqiao clicked his tongue in wonder and commented, "Ning Yao, your personality can't compare to Celestial Maiden Su's."

source: 刘灞桥嗤笑道：“是那娘们吹牛不打草稿，还是欺负我刘灞桥没学问？她家能有功德坊？”
en_us: "I reckon it's that woman blowing her own trumpet," Liu Baqiao sneered. "Is she trying to pick on me because she thinks I'm uneducated? Her clan is able to have a merit archway?"

source: 刘灞桥嘀嘀咕咕道：“早知道应该让陈平安留下一竹筒腌菜的。”
en_us: "If I had known this, I should have asked Chen Ping'an to leave us a tube of pickled vegetables as well," Liu Baqiao muttered.

source: 刘灞桥嘿嘿一笑，指了指这位崔先生，“我已经懂了。”
en_us: Liu Baqiao grinned as he wagged a finger at the scholarly man. "Even if you don't say anything, I already know the answer."

source: 刘灞桥在木板廊道上使劲跺了跺脚，道：“可是我刚才趴在地上，用手敲了半天，也没能发现端倪，难道此物与我无缘？照理来说不可能啊，如我这般不世出的剑道天才，那老剑条若真是神兵利器，不说自己跑到我跟前来认主，好歹应该所有感应共鸣吧？难道老剑条其实不过尔尔，当真只是个岁月久一点的老物件而已？唉，可惜了可惜了。”
en_us: Liu Baqiao forcefully stomped his feet on the wooden walkway of the covered bridge, continuing, "However, I lay on the ground and knocked on the bridge for half a day, but I still didn't make any discoveries. Perhaps this treasure isn't fated to be mine? But how can that be? I'm a hidden sword prodigy! If that old sword really is a divine weapon, it should at least resonate with me even if it doesn't fly over to accept me as its master, right? Maybe this old sword is only so-so, and really isn't anything more than a slightly older object? Sigh... What a shame..."

source: 刘灞桥大怒，拿下书箱摔向陈对，“老子还不伺候了！”
en_us: Liu Baqiao was furious, and he immediately threw the bookcase at Chen Dui, shouting, "Bullshit! I'm not going to take your crap anymore!"

source: 刘灞桥好奇问道：“难不成那老畜生三拳干翻了宋长镜？宋长镜如此绣花枕头不济事？不是都说他摸着了第十境的门槛吗，只差半步就能一脚跨入那个境界。”
en_us: A curious look appeared on Liu Baqiao's face as he asked, "Could it be that the old monkey took out Song Changjing with just three punches? Is Song Changjing that useless? Isn't everyone saying that he's already on the cusp of reaching the 10th tier?"

source: 刘灞桥实在好奇，眼前这个看着细胳膊细腿的草鞋少年，是如何蕴养出如此惊人的爆发力？
en_us: Liu Baqiao was truly curious. Just how did this skinny young boy possess such astonishing and explosive power?

source: 刘灞桥实在看不下去，陈松风性子软绵不假，可好歹是龙尾郡陈氏的未来家主，不管你陈对什么来历背景，是不是同宗同族，最少也应该给予必要的尊重，所以刘灞桥沉声道：“陈对，我没有眼瞎的话，看得出陈松风现在是给你帮忙，你就算不领情，也别说话这么难听！”
en_us: Liu Baqiao truly couldn't watch on anymore. Chen Songfeng was indeed a meek person, but he was still the future clan leader of Dragon Tail County's Chen Clan. Regardless of Chen Dui's background, and regardless of wether they were from the same clan or same sect, she still at least needed to show him some basic respect. Thus, Liu Baqiao's voice was solemn as he said, "Chen Dui, if I'm not blind, Chen Songfeng is helping you right now. So even if you're not grateful, you shouldn't speak to him in such a demeaning manner!"

source: 刘灞桥干笑道：“虽热事实如此，但是这种恩人我可不想当。”
en_us: "That may be the case, but I have no intention of accepting credit for something like this," Liu Baqiao replied with a wry smile.

source: 刘灞桥心中隐隐不快，问道：“那些孩子的下场如何？”
en_us: Liu Baqiao felt a slight hint of displeasure, and he asked, "Then what happens to those children?"

source: 刘灞桥心有戚戚然，点头道：“也是。”
en_us: With sadness in his heart, Liu Baqiao nodded and concurred, "Indeed."

source: 刘灞桥想了想，出声安慰那名字有些古怪的女子，免得她一时想不开，铁了心要以卵击石，去找宋长镜的麻烦，到时候这一屋子的人都吃不了兜着走，“陈大姐，虽然我这么说很长他人志气灭自己威风，但是碰到宋长镜，低低头，退一步，不丢人。”
en_us: Liu Baqiao hesitated momentarily, then decided to offer some words of consolation to Chen Dui, in case she decided to recklessly go after Song Changjing out of blind vengeful fury. If that were to happen, then everyone in this room would've been in huge trouble. "Sister Chen, I know that it may be a bitter pill to swallow, but there's no shame in backing down against Song Changjing."

source: 刘灞桥想起那天在衙署正堂爆发的冲突，感慨道：“宋长镜实在是太强了，最可怕的这位大骊藩王还如此年轻，一般的第八、第九境武人，谁不是半百、甲子年龄往上走的，甚至百岁也不算高龄，可是如果我没有记错的化，宋长镜才将近四十岁吧。难怪当初要被那人笑称‘需要压一压气焰’。”
en_us: Thinking back to the conflict that had taken place in the kiln supervision office, Liu Baqiao sighed, "Song Changjing really is incredibly powerful. What makes him even more terrifying is just how young he is! Generally speaking, all martial artists at the eighth or ninth tiers have to be upward of 50 to 60 years of age. In fact, even those who only reach that level at 100 years of age aren't considered to be slow, but if I recall correctly, Song Changjing isn't even 40 yet. No wonder that man once remarked that he needs to 'be put in his place'."

source: 刘灞桥愈发得意，“对！苏稼，禾之秀实为稼，那位圣人所谓好稼者众矣的稼！怎么样，我家苏仙子，是不是名字也动人心魄？”
en_us: "That's right!" Liu Baqiao replied with increasing smugness. "Jia as in the Jia from the Sage's words, 'crops are liked by all people'[ref]The Chinese character for Jia literally means crops.[/ref]! How is it? Isn't my missus' name beautiful and soul-stirring?"

source: 刘灞桥愣了愣，低声笑道：“别这么见外啊，我跟你们吃一个竹筒。”
en_us: Liu Baqiao faltered for a moment before chuckling softly and saying, "Haha, there's no need to treat me as an outsider. I can eat from the same bamboo tube as you two."

source: 刘灞桥愣了愣，震惊道：“我根本没听说啊，正阳山是谁来了？”
en_us: Liu Baqiao was stunned to hear this. "No, I didn't hear about that at all! Who did the Sun Scorch Mountain send?"

source: 刘灞桥愤懑道：“凭啥？！”
en_us: "Why?!" Liu Baqiao fumed.

source: 刘灞桥所谓的学宫书院坊，自然是儒家正统的三学宫七十二书院，绝非世俗王朝的普通书院。
en_us: The so-called academy archways that Liu Baqiao spoke of were naturally the achways related to the three schools and 72 academies of Confucianism. He most definitely wasn't talking about the ordinary academies in mortal empires.

source: 刘灞桥打开一截竹筒，露出雪白的饭团，兴高采烈道：“还是陈平安厚道，不愧是我的好兄弟。”
en_us: Liu Baqiao cracked open a bamboo tube, revealing the snow-white balls of rice insde. His spirits were high as he praised, "Sure enough, Chen Ping'an is still as kind as always. As expected of my good brother."

source: 刘灞桥扭了扭屁股，双臂环胸，好整以暇道：“好了，知道那位祖宗奶奶的吓人来历了，你接着说正题。”
en_us: Liu Baqiao sat back down and wrapped his arms around his chest, appearing calm and composed as he said, "Alright, I know that her background is terrifying now. You can continue."

source: 刘灞桥把到了嘴巴的一些话咽回去，省得伤感情。陈松风这个家伙，虽然没那么合胃口对脾气，可是比起一般的读书人，已经好上许多，自己就知足吧。
en_us: Liu Baqiao was just about to answer the question, but ultimately decided against it as he didn't want to hurt Chen Songfeng's feelings. Chen Songfeng wasn't someone that he got along particularly well with, but he already had a far better personality than the average scholar, so Liu Baqiao had to learn to be content.

source: 刘灞桥抱着后脑勺，扬起脑袋望向天空，仍是优哉游哉的慵懒神色，“我知道你陈松风不是这样的人，可惜像你这样的人，到底少，不像你的人，终究多。”
en_us: Liu Baqiao's hands were still clasped behind his head as he looked up at the sky in a lackadaisical manner and said, "I know that you're not that type of person, but unfortunately, people like you are part of the minority. Let me give an example here related to myself. That Mountain-moving Ape from Sun Scorch Mountain wasn't able to secure the sword scripture, and he was afraid that our Wind Lightning Field would obtain it, so he killed that boy with the Liu Surname. Do you think what he did was reasonable? I think it's extremely unreasonable, but so what? What I think doesn't matter because I don't even have the courage to provoke the old ape to his face."

source: 刘灞桥拍了拍肩膀，“不如改换门庭，加入我们风雷园练剑，以后我罩你。你想啊，成为一名剑修，御剑凌风，万丈高空，风驰电掣，尤其是雷雨时分，踏剑穿梭其中……”
en_us: Liu Baqiao patted Chen Songfeng on the shoulder and suggested, "How about you join our Wind Lightning Field and become a swordsman? I'll make sure to look out for you. Think about it, if you become a swordsman, you'll be able to soar through the heavens atop a flying sword. Especially during lightning storms..."

source: 刘灞桥摇头道：“不是道理很难说清楚，事实上，本来就是你们没道理，只是因为那个少年太弱小，所以才让你们能够显得理直气壮，加上你们龙尾郡陈氏的声势，比少年大许多，可是比起身边那些看笑话的人，又很一般，所以处境愈发尴尬，到最后，不愿意承认自己无能，只好反过来暗示自己，认为那个少年才是罪魁祸首。我相信如果不是这座骊珠洞天不容易进入，那个让龙尾郡陈氏难堪的陋巷少年，早就被龙尾郡陈氏子弟，悄悄找个由头做掉，或是某个附庸家族的家伙，杀之邀功了。”
en_us: Liu Baqiao shook his head as he said, "It's not difficult to make people see reason, the problem is that you're being completely unreasonable to begin with. It's only because that boy is weak and vulnerable that you feel justified in condemning him. On top of that, the branch of your Chen Clan in Dragon Tail County is certainly far more powerful than a lonesome boy, but at the same time, you're very mediocre compared with those having a laugh at your expense. You're being made into a laughingstock, but you don't have the power to retaliate, and instead of admitting your own shortcomings, you choose to pin the blame entirely on that boy, insisting that he's the scapegoat. I'll bet that if it isn't for the rules prohibiting the killing of local residents of the Jewel Small World, someone from your branch of the Chen Clan would've already killed off that young boy in secret, for no reason other than to save face."

source: 刘灞桥收敛玩笑神色，沉声道：“崔明皇，这种话你以后到了风雷园，千万千万别跟人说半个字。”
en_us: Liu Baqiao's joking demeanor faded as he said in a serious voice, "Cui Minghuang, make sure you never say that to anyone after you get to the Wind Lightning Field."

source: 刘灞桥收起大拇指，不去和走在前边的陈对陈松风并肩而行，反而走在陈平安一侧，扭头笑道：“虽说那正阳山就是个小山包，躲着一些个名不副实的缩头乌龟，可那头护山猿凶名赫赫，是一拳一拳打出来的名号，尤其是在正阳山的开山老祖死后，在正阳山开出第三峰前的头个两百年里，几乎都是靠着这头老猿护着正阳山，才没被周边势力吞并。当然了，那会儿的正阳山，到底还只是个不成气候的小门小户，需要面对的敌人，不算太强，要是那会儿就惹上咱们风雷园，嘿，没悬念，只需要老祖一声令下，赏我一块御剑牌，我就可以一个人跑到正阳山的上空，轻轻丢下咱们那座雷池剑阵，下过这场剑雨之后，正阳山就算玩完了。”
en_us: Liu Baqiao retracted his thumb and slowed down a little, not walking side-by-side with Chen Dui and Chen Songfeng anymore. Instead, he chose to walk next to Chen Ping'an. He turned around and said with a smile, "Even though Sun Scorch Mountain is only a measly hill that houses some cowards who don't live up to their reputation, that old ape has indeed built up his reputation using his fists and strength. This was especially the case after the founding sect leader of Sun Scorch Mountain passed away. In the 200 years prior to when Sun Scorch Mountain opened their third mountain, it was essentially that old ape alone who guarded the entire Sun Scorch Mountain. It was because of him that Sun Scorch Mountain wasn't gobbled up by the nearby forces. "Of course, Sun Scorch Mountain had only been a small and mediocre sect at that time. Because of this, their enemies weren't too powerful either. If they had offended our Wind Lightning Field at that time... Heh, their fate would have been sealed. With a single command from the elder, I would be granted a sword tablet. I would then fly above Sun Scorch Mountain myself and lightly drop our Lightning Field Sword Formation. After facing this downpour of swords, Sun Scorch Mountain would be done for."

source: 刘灞桥无奈叹息，“重色轻友，我能理解。”
en_us: Liu Baqiao sighed in exasperation, remarking, "Valuing your lover over your friend... I can understand this."

source: 刘灞桥最受不了别人苦情和煽情，赶紧摆手道：“别别别，我就是瞧不上你家远房亲戚的欺软怕硬，我说她几句，纯粹是我自己管不住嘴，你陈松风不用感恩戴德。”
en_us: Liu Baqiao wasn't someone who could tolerate listening to the complaints and plights of others, so he hurriedly waved his hands and said, "Please spare me. I was simply unable to stand your distant relative's bullying of the weak and cowering to the strong. Also, I only criticized her because I was unable to control my tongue, so there's no need for you to thank me."

source: 刘灞桥有些吃瘪，继续不服气问道：“那学宫书院坊，她家能有？！”
en_us: Liu Baqiao was slightly disgruntled, and he was unwilling to yield as he continued to insist, "Then does her clan have an academy archway?!"

source: 刘灞桥没心没肺道：“其实不甘心都不用，看看我，现在就贼高兴，以后回到风雷园，又有十年牛皮可以吹了，竟然与大骊宋长镜交过手，哪怕只有一招，但我刘灞桥到最后毫发无损啊！当然了，如果我真能拿到那把大骊京城的符剑，吹一百年都行！”
en_us: "There's no need even for that. Take a look at me, I'm super happy right now. After I go back to the Wind Lightning Field, I'll be able to boast to everyone for the next decade that I faced Song Changjing of the Great Li Empire in battle! Even though it was only for a single exchange, the fact of the matter is that I managed to come out completely unscathed! If I can obtain the talismanic sword from the capital of the Great Li Empire, I'd have something to boast about for the next century!" Liu Baqiao said in a shameless manner.

source: 刘灞桥没有任何尴尬神色，以迅雷不及掩耳之势转换话题，对陈平安神秘兮兮道：“听说这座廊桥的前身，是一座石拱桥，石拱桥底下挂着一根生锈的老剑条，以防龙走水？一般而言，这种瞧着不起眼的老玩意儿，肯定不是俗物，说不得就是惊天地泣鬼神的灵宝神物，”
en_us: Liu Baqiao didn't feel embarrased or ashamed at all. Instead, he quickly and smoothly changed topics, and he said to Chen Ping'an in a mysterious voice, "I heard that this covered bridge used to be a stone arch bridge, and there's a rusty old sword hanging under it. I think that it's used to keep out dragons and floods? Generally speaking, these old and seemingly unremarkable objects are almost definitely extraordinary treasures. Perhaps this is even a divine treasure that can astonish heaven and earth."

source: 刘灞桥满脸得意，走路的步伐都有些飘，大声道：“腌菜啊，我吃过的！”
en_us: Liu Baqiao wore a smug expression as he announced loudly, "Pickled vegetables? I've eaten them before!" Even his footsteps became lighter and livelier.

source: 刘灞桥灵光一现，“刘姓少年的祖上，是陈对那一支陈氏留在小镇的守墓人？”
en_us: Liu Baqiao came to a sudden realization, and he guessed, "Liu Xianyan's ancestors were the graveyard attendents for Chen Dui's clan?"

source: 刘灞桥点点头。
en_us: Liu Baqiao nodded in reply.

source: 刘灞桥点点头，“远远不止。”
en_us: "Indeed, it goes far beyond that," Liu Baqiao replied with a nod.

source: 刘灞桥爽朗大笑道：“几个鬼鬼祟祟的野修罢了，靠着一点歪门邪道，才侥幸伤到本公子，反正已是我剑下亡魂，不值一提！如果不是急着赶路，本公子就要给他们弄几座衣冠冢，立块墓碑，写下他们于某年某月某日死于刘灞桥剑下，将来等我成为剑道第一人，说不得还会成为一处风景名胜，对不对？”
en_us: Liu Baqiao burst into laughter upon hearing this. "They were just a few sneaky vagrant cultivators who were extremely fortunate to have been able to hurt me. In any case, they've already perished by my sword, and they're really not worth mentioning at all. If it weren't for the fact that we were in a hurry, I would've buried them and erected a few tombstones, on which I would've inscribed the year, month, and day on which they had perished by my sword. When I become the number one swordsman in the future, those tombs will become a tourist attraction!"

source: 刘灞桥狗不了吃屎，坏笑道：“人上有人？崔大先生你真是一点也不君子啊！”
en_us: Liu Baqiao was unable to resist the urge to make an innuendo here, and a sly grin appeared on his face as he said, "There's always someone above me? Are you saying I always like to be on the bottom? I can't believe an esteemed gentleman like yourself would say something like this!"

source: 刘灞桥疑惑道：“那刘姓少年，不是差点被那头老猿一拳打死了吗？”
en_us: "Wasn't Liu Xianyang almost smashed to death by the old ape?" Liu Baqiao asked in puzzlement.
